PANDAS - Multi-indexing

In [1]:
# we define index (keys) as tuples
# we want to look at population for states in 2 different years
index = [('CAL',2000),('CAL',2010),('NY',2000),('NY',2010),('TX',2000),('TX',2010)]

In [2]:
population =(338,372,189,193,208,251)

In [3]:
import pandas as pd
import numpy as np

In [4]:
pop = pd.Series(population, index = index)
# this is the 'bad way' of defining two-dimensional (or more) dataframe

In [5]:
pop

(CAL, 2000)    338
(CAL, 2010)    372
(NY, 2000)     189
(NY, 2010)     193
(TX, 2000)     208
(TX, 2010)     251
dtype: int64

In [6]:
# we can still do some 'operations'
# ex: slicing
pop[('CAL',2000):('NY',2010)]

(CAL, 2000)    338
(CAL, 2010)    372
(NY, 2000)     189
(NY, 2010)     193
dtype: int64

In [7]:
# apart from slicing
# we cannot do much

In [8]:
pop.index

Index([('CAL', 2000), ('CAL', 2010),  ('NY', 2000),  ('NY', 2010),
        ('TX', 2000),  ('TX', 2010)],
      dtype='object')

In [9]:
pop.values

array([338, 372, 189, 193, 208, 251], dtype=int64)

In [10]:
# EX:
# select all values of 2010
# using list comprehension
pop2010=pop[[i for i in pop.index if i[1]==2010]]
pop2010

(CAL, 2010)    372
(NY, 2010)     193
(TX, 2010)     251
dtype: int64

In [11]:
pop_2010b=[pop[(s,y)] for (s,y) in pop.index if y==2010]
pop_2010b

[372, 193, 251]

In [12]:
pop

(CAL, 2000)    338
(CAL, 2010)    372
(NY, 2000)     189
(NY, 2010)     193
(TX, 2000)     208
(TX, 2010)     251
dtype: int64

In [13]:
# it is better to use multi-indexing
new_index = pd.MultiIndex.from_tuples(index)

In [14]:
new_index

MultiIndex(levels=[['CAL', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [15]:
pop = pop.reindex(new_index)
pop

CAL  2000    338
     2010    372
NY   2000    189
     2010    193
TX   2000    208
     2010    251
dtype: int64

In [16]:
pop[:,2000]

CAL    338
NY     189
TX     208
dtype: int64

In [17]:
# unstacking
# unstack takes a multi-index series and transforms it into a dataframe
pop_df = pop.unstack()
pop_df

     2000  2010
CAL   338   372
NY    189   193
TX    208   251

In [18]:
# opposite process:
pop2 =pop_df.stack
pop2

<bound method DataFrame.stack of      2000  2010
CAL   338   372
NY    189   193
TX    208   251>

In [19]:
pop3 = pd.DataFrame({'population':pop,'teenagers':[926,928,468,431,590,687]})
pop3

          population  teenagers
CAL 2000         338        926
    2010         372        928
NY  2000         189        468
    2010         193        431
TX  2000         208        590
    2010         251        687

In [20]:
pop3.unstack()

    population      teenagers
          2000 2010      2000 2010
CAL        338  372       926  928
NY         189  193       468  431
TX         208  251       590  687

In [21]:
# it is easier to index in a multi-index

----

USING DATASET of EXOPLANETS (available inside seaborn library),
planets outside Solar system

In [22]:
import seaborn as sns

In [23]:
planets = sns.load_dataset('planets')

In [24]:
planets.shape

(1035, 6)

In [25]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [26]:
# aggregation tools
import numpy as np
import pandas as pd

In [27]:
# note that there are some Nans in the datasets
# here we have many data (so we will drop them)
# let's drop the all rows
planets.dropna().describe()
# all the rows which have a Nan have been dropped

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [28]:
# to treat each column independently
planets.dropna(how='all').describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [29]:
planets.dropna().describe()
# very quick way to summarise data
# we can apply function describe to any dataframe

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [30]:
# first discovery: 1989
# last discovery reported in this data: 2014
# 25% were discovered between 1989 and 2005, other 25% from 2005 and 2009, other 25% from 2009 and 2011
# last 25% from 2011 till 2014

In [31]:
# all the methods above can be run by themselves, separately
planets.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [32]:
planets.dropna().std()

number               1.175720
orbital_period    1469.128259
mass                 3.636274
distance            46.596041
year                 4.167284
dtype: float64

In [33]:
# GROUP BY
planets.groupby('method')

In [34]:
# this above is an object
planets.groupby('method')['number'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: number, dtype: int64

In [35]:
# group by method and year to see when they were used for a discovery first
planets.groupby('method')['year'].min()

method
Astrometry                       2010
Eclipse Timing Variations        2008
Imaging                          2004
Microlensing                     2004
Orbital Brightness Modulation    2011
Pulsar Timing                    1992
Pulsation Timing Variations      2007
Radial Velocity                  1989
Transit                          2002
Transit Timing Variations        2011
Name: year, dtype: int64

In [36]:
# to look at mean years
planets.groupby('method')['year'].mean()

method
Astrometry                       2011.500000
Eclipse Timing Variations        2010.000000
Imaging                          2009.131579
Microlensing                     2009.782609
Orbital Brightness Modulation    2011.666667
Pulsar Timing                    1998.400000
Pulsation Timing Variations      2007.000000
Radial Velocity                  2007.518987
Transit                          2011.236776
Transit Timing Variations        2012.500000
Name: year, dtype: float64

In [37]:
# to look at all aggregate functions at once
planets.groupby('method')['year'].describe()

method
Astrometry                   count       2.000000
                             mean     2011.500000
                             std         2.121320
                             min      2010.000000
                             25%      2010.750000
                             50%      2011.500000
                             75%      2012.250000
                             max      2013.000000
Eclipse Timing Variations    count       9.000000
                             mean     2010.000000
                             std         1.414214
                             min      2008.000000
                             25%      2009.000000
                             50%      2010.000000
                             75%      2011.000000
                             max      2012.000000
Imaging                      count      38.000000
                             mean     2009.131579
                             std         2.781901
                             min      2004.000000
                             25%      2008.000000
                             50%      2009.000000
                             75%      2011.000000
                             max      2013.000000
Microlensing                 count      23.000000
                             mean     2009.782609
                             std         2.859697
                             min      2004.000000
                             25%      2008.000000
                             50%      2010.000000
                                         ...
Pulsation Timing Variations  std              NaN
                             min      2007.000000
                             25%      2007.000000
                             50%      2007.000000
                             75%      2007.000000
                             max      2007.000000
Radial Velocity              count     553.000000
                             mean     2007.518987
                             std         4.249052
                             min      1989.000000
                             25%      2005.000000
                             50%      2009.000000
                             75%      2011.000000
                             max      2014.000000
Transit                      count     397.000000
                             mean     2011.236776
                             std         2.077867
                             min      2002.000000
                             25%      2010.000000
                             50%      2012.000000
                             75%      2013.000000
                             max      2014.000000
Transit Timing Variations    count       4.000000
                             mean     2012.500000
                             std         1.290994
                             min      2011.000000
                             25%      2011.750000
                             50%      2012.500000
                             75%      2013.250000
                             max      2014.000000
Name: year, dtype: float64

In [38]:
# ex radial velocity was used for the first discovery in 1989
# but was used mainly around 2007 for that
# Transit and Radial Velocity were the method more used for discoveries

In [39]:
# we want info on the quality of the methods...ex looking at the mass of the planets identified
# we want to group methods in base of mass of planets
# we want first to drop Nan from mass column
planets.dropna(subset=['method','number','mass']).groupby('method')['mass'].describe()

method
Eclipse Timing Variations  count      2.000000
                           mean       5.125000
                           std        1.308148
                           min        4.200000
                           25%        4.662500
                           50%        5.125000
                           75%        5.587500
                           max        6.050000
Radial Velocity            count    510.000000
                           mean       2.630699
                           std        3.825883
                           min        0.003600
                           25%        0.225250
                           50%        1.260000
                           75%        3.000000
                           max       25.000000
Transit                    count      1.000000
                           mean       1.470000
                           std             NaN
                           min        1.470000
                           25%        1.470000
                           50%        1.470000
                           75%        1.470000
                           max        1.470000
Name: mass, dtype: float64

In [40]:
# but not data on mass for transit

In [41]:
# AIM: count discovered planets by method and decade
# // in Python does flooring = we divide by 10 and take the lower integer
decade = 10 *(planets['year']//10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [42]:
# groupby takes not only 'method' but also a function (decade)
# decade is a new manifactured column which has the same index of my original data
# so we can use it in groupby

---

Joining and Merging
(example of relational algebra, as done in SQL)

In [43]:
df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Alex','Tom'],
                  'group':['Accounting','Engineering','Engineering','Sales','Accounting']})

In [44]:
df2 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Alex','Tom'],
                  'hire_date':[2004,2008,2012,2012,2005]})

In [45]:
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3     Alex        Sales
4      Tom   Accounting
  employee  hire_date
0      Bob       2004
1     Jake       2008
2     Lisa       2012
3     Alex       2012
4      Tom       2005

In [46]:
pd.merge(df1,df2)
# no need to say to merge on the names

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2012
3     Alex        Sales       2012
4      Tom   Accounting       2005

In [47]:
df4=pd.DataFrame({'group':['Accounting','Engineering','Sales'],
                 'supervisor':['Ben','Dan','Rob']
                 })

In [48]:
df3 = pd.merge(df1,df2)
# One-to-one join

In [49]:
pd.merge(df3,df4)
# Many-to-one join (df4 has less number of elements)

  employee        group  hire_date supervisor
0      Bob   Accounting       2004        Ben
1      Tom   Accounting       2005        Ben
2     Jake  Engineering       2008        Dan
3     Lisa  Engineering       2012        Dan
4     Alex        Sales       2012        Rob

In [50]:
df5 = pd.DataFrame({'group':['Accounting','Accounting','Engineering','Engineering','Sales','Sales'],
                   'skills':['math','spreadsheets','coding','linux','spreadsheets','finance']})

In [51]:
# Many-to-many
pd.merge(df1,df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2      Tom   Accounting          math
3      Tom   Accounting  spreadsheets
4     Jake  Engineering        coding
5     Jake  Engineering         linux
6     Lisa  Engineering        coding
7     Lisa  Engineering         linux
8     Alex        Sales  spreadsheets
9     Alex        Sales       finance

In [52]:
# we can specify on the column we want to merge to
df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Alex','Tom'],
                  'group':['Accounting','Engineering','Engineering','Sales','Accounting']})

In [53]:
# we can specify the column to merge on
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2012
3     Alex        Sales       2012
4      Tom   Accounting       2005

In [54]:
df3 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Alex','Tom'],
                  'salary':['31000','50000','150000','25000','450']})

In [55]:
# we want to join this to dataframe 1 on index
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

In [56]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Alex            Sales
Tom        Accounting

In [57]:
df2a

          hire_date
employee
Bob            2004
Jake           2008
Lisa           2012
Alex           2012
Tom            2005

In [58]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2004
Jake      Engineering       2008
Lisa      Engineering       2012
Alex            Sales       2012
Tom        Accounting       2005

In [59]:
# we can start using JOIN
df1a.join(df2a)
# this is the same as pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2004
Jake      Engineering       2008
Lisa      Engineering       2012
Alex            Sales       2012
Tom        Accounting       2005

In [60]:
pd.merge(df1a, df3, left_index=True, right_on='employee')
# for joining
# we can use index in df1a ('employee')
# but we need to indicate the column 'employee' for df3 as normal index is instead 0 to 4

         group employee  salary
0   Accounting      Bob   31000
1  Engineering     Jake   50000
2  Engineering     Lisa  150000
3        Sales     Alex   25000
4   Accounting      Tom     450

In [61]:
df1a
# the index of df1a is employee

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Alex            Sales
Tom        Accounting

In [62]:
df3
# the index of df3 is in numbers 0 to 4 (normal index)

  employee  salary
0      Bob   31000
1     Jake   50000
2     Lisa  150000
3     Alex   25000
4      Tom     450